import json
def count_letters(text1):
    text1 = text1.lower()
    symbols = ''.join(text1.split())
    letters = ''.join(c for c in symbols if c.isalpha())
    return letters
    
def calculate_frequency(symbols):
    letters_dict = {}
    for i in range(32):
        frequency = symbols.count(chr(i + ord('а')))/len(symbols)
        letters_dict[chr(i + ord('а'))] = round(frequency,2)
    return letters_dict

main_str = """
У лукоморья дуб зелёный;
Златая цепь на дубе том:
И днём и ночью кот учёный
Всё ходит по цепи кругом;
Идёт направо — песнь заводит,
Налево — сказку говорит.
Там чудеса: там леший бродит,
Русалка на ветвях сидит;
Там на неведомых дорожках
Следы невиданных зверей;
Избушка там на курьих ножках
Стоит без окон, без дверей;
Там лес и дол видений полны;
Там о заре прихлынут волны
На брег песчаный и пустой,
И тридцать витязей прекрасных
Чредой из вод выходят ясных,
И с ними дядька их морской;
Там королевич мимоходом
Пленяет грозного царя;
Там в облаках перед народом
Через леса, через моря
Колдун несёт богатыря;
В темнице там царевна тужит,
А бурый волк ей верно служит;
Там ступа с Бабою Ягой
Идёт, бредёт сама собой,
Там царь Кащей над златом чахнет;
Там русский дух… там Русью пахнет!
И там я был, и мёд я пил;
У моря видел дуб зелёный;
Под ним сидел, и кот учёный
Свои мне сказки говорил.
"""
letters_main = count_letters(main_str)
dict = calculate_frequency(letters_main)
for i in range(32):
    print(chr(i + ord('а')),':',dict[chr(i + ord('а'))])
